app/controllers/usagers_controller.rb

  def index
    @usagers = Usager.all
---
SELECT "usagers".* FROM "usagers"

  def create
    @usager = Usager.new(usager_params)

    respond_to do |format|
      if @usager.save
---
INSERT INTO "usagers" ("courriel", "nom", "motPasse", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usager.update(usager_params)
---
UPDATE "usagers" SET "nom" = ?, "updated_at" = ? WHERE "usagers"."id" = ?  [["nom", "directeur1"], ["updated_at", "2017-06-28 17:15:58.490949"], ["id", 1]]

  def destroy
    @usager.destroy
---
DELETE FROM "usagers" WHERE "usagers"."id" = ?  [["id", 2]]

    def set_usager
      @usager = Usager.find(params[:id])
---
SELECT  "usagers".* FROM "usagers" WHERE "usagers"."id" = ? LIMIT 1  [["id", 2]]